index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-10 ဟူး 19:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yelinaung" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3b9fd52">1. Setup steps</a></li>
<li><a href="#org2bea5ef">2. Notes</a>
<ul>
<li><a href="#org21fbdaf">2.1. Git by Phway Thant Chae</a></li>
</ul>
</li>
<li><a href="#orgece9096">3. Reading List and Notes for Internship program</a>
<ul>
<li><a href="#org3ed0a76">3.1. Ruby Reading List</a></li>
<li><a href="#org5af1711">3.2. Git Reading List</a></li>
</ul>
</li>
<li><a href="#orgdbf8d0e">4. Assignment</a>
<ul>
<li><a href="#org043893d">4.1. First Assignment (Git)</a></li>
<li><a href="#org26606da">4.2. Second Assignment (Calculator.rb)</a></li>
</ul>
</li>
<li><a href="#org466ad44">5. FAQ</a>
<ul>
<li><a href="#org1ef3854">5.1. Please tell me who you are ** error တက်ခဲ့လျှင်</a></li>
<li><a href="#orgba6ff16">5.2. Project တည်ဆ​ောက်ထားခြင်း မရှိသ​ေးပါက</a></li>
<li><a href="#org254e04a">5.3. Project တည်ဆ​ောက်ထားပြီးသားရှိပါက</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#+Edited on <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-10-09 ဂါ&gt;</span></span>
</p>



<div id="outline-container-org3b9fd52" class="outline-2">
<h2 id="org3b9fd52"><span class="section-number-2">1</span> Setup steps</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Open Github account at <a href="https://github.com">https://github.com</a></li>
<li>Create Repo with calculater ruby</li>
<li>Require Working Git Bash / Source tree</li>
<li>Require at least 1 code editor ( VS Code / Notepad ++ / Emacs / Vim / Sublime Text)</li>
<li>Require  Ruby.</li>
</ol>
</div>
</div>
<div id="outline-container-org2bea5ef" class="outline-2">
<h2 id="org2bea5ef"><span class="section-number-2">2</span> Notes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org21fbdaf" class="outline-3">
<h3 id="org21fbdaf"><span class="section-number-3">2.1</span> Git by Phway Thant Chae</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Project တည်ဆ​ောက်ထားခြင်း မရှိသ​ေးပါက  Github မှာ Project  ကိုအသစ်ဆ​ောက်ပါ။  မိမိစက်တွင် clone လုပ်ရန် "git clone URL"  ကို command တွင် ရိုက်ထည့်ပါ။</li>
<li>Project တည်ဆ​ောက်ထားပြီးသားရှိပါက " git remote add origin URL "  command တွင် ရိုက်ထည့်ပါ။  ရှိပြီးသား project တွင် git ထည့်လိုပါက "git init" ပြုလုပ်ပါ။</li>
<li>Project အတွင်းရှိ ဖိုင်များ ၏ အခြေအနေကို သိလိုပါက "git status" ပြုလုပ်ပါ။</li>
<li>ပြောင်းလဲမှုပြုလုပ်ထားသောဖိုင်များကို  staging အဆင့်သို့ပေးပို့ရန် "git  add  &lt;filename&gt;" ပြုလုပ်ပါ။</li>
<li>Staging ပြုလုပ်ပြီးသောဖိုင်များကို commit လုပ်ရန် ' git commit -m "&lt;commit message&gt;"  '.</li>
<li>Github သို့ပေးပို့ရန် " git push -u origin master " ပြုလုပ်ပါ။</li>
<li>Github မှ ဖိုင်များကို download ပြုလုပ်ရန် " git pull origin master" ပြုလုပ်ပါ။</li>
<li>မိမိပြုလုပ်ထားသော commit log များကို ကြည့်ရှုရန် " git log " ပြုလုပ်ပါ။</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgece9096" class="outline-2">
<h2 id="orgece9096"><span class="section-number-2">3</span> Reading List and Notes for Internship program</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3ed0a76" class="outline-3">
<h3 id="org3ed0a76"><span class="section-number-3">3.1</span> Ruby Reading List</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><a href="https://launchschool.com/books/ruby/read/variables#gettingdatafromauser">Ruby Getting Data</a></li>
<li><a href="https://www.tutorialspoint.com/ruby/ruby_loops.htm">Ruby Loops</a></li>
<li><a href="http://ask.tiide.org/index.php?p=/discussion/comment/72#Comment_72">Tiide.org training Videos</a></li>
<li><a href="https://www.tutorialspoint.com/ruby/">Tutorial Point Ruby</a></li>
</ol>
</div>
</div>
<div id="outline-container-org5af1711" class="outline-3">
<h3 id="org5af1711"><span class="section-number-3">3.2</span> Git Reading List</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><a href="http://try.github.io/">Try Github.io</a></li>
<li><a href="http://marklodato.github.io/visual-git-guide/index-en.html">Visualization Git</a></li>
<li><a href="https://www.syncfusion.com/ebooks/git">Git Succinctly</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgdbf8d0e" class="outline-2">
<h2 id="orgdbf8d0e"><span class="section-number-2">4</span> Assignment</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org043893d" class="outline-3">
<h3 id="org043893d"><span class="section-number-3">4.1</span> First Assignment (Git)</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>Create your own account in Github.</li>
<li>Create a repository called "Calculator" in Github.</li>
<li>Git clone "Calculator" project in your local machine.</li>
<li>Create README.md in "Calculator project".  ( README.md should include brief introduction about the ruby calculator program )</li>
<li>Push ruby calculator program code and README.md to "Calculator" repo.</li>
</ol>
</div>
</div>
<div id="outline-container-org26606da" class="outline-3">
<h3 id="org26606da"><span class="section-number-3">4.2</span> Second Assignment (Calculator.rb)</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Calculator program မှာ ကိန်း ၂ ခုကို user ဆီက တောင်းပါမယ်။ ပြီးရင် အဲ့ကိန်း၂ခုရဲ့ ပေါင်းလဒ်၊ နုတ်လဒ်၊ မြေှာက်လဒ်၊ စားလဒ် နဲ့ အကြွင်း တို့ကို screen မှာပြပါ</li>
<li>အဲ့အဆင့်ပြီးရင် user ဆီက ကိန်း၂ခုကို ဘာလုပ်မှာလဲ ဆိုတာတောင်းပြီး တောင်းတဲ့ operation အတိုင်း ဆောင်ရွက်ပြီး result ကို ပြပါ။</li>
<li>အဲ့အဆင့်ပြီးရင် နောက် အဆင့်အနေနဲ့ user ကို ထပ်ပြီး operation (ပေါင်း၊ နုတ်၊ မြေှာက်၊ စား) လုပ်ချင်သေးလား။ မေးတာထည့်မယ်။ user က ထပ်လုပ်မယ် y ဆိုရင် ကိန်း၂ခုပြန်တောင်း။ operation (ပေါင်း၊ နုတ်၊ မြေှာက်၊ စား) ပြန်တောင်းပြီး အဖြေပြ။  ပြီးရင် ပေါင်း၊ နုတ်၊ မြေှာက်၊ စား လုပ်မှာလား ပြန်မေး၊ user က မလုပ်တော့ဘူး n ဆိုမှ program ပြီးမယ်။</li>
<li>user ရိုက်လိုက်တဲ့ operand 2 ခု၊ operator နဲ့ သူ့ result ကို File တစ်ခုမှာ save ရမှာပါ။</li>
<li>program 4 က user က ဘာ ရိုက်လိုက်တယ်. ဘာ result ထွက်လာတယ်. ဆိုတာကို file မှာ save လုပ်တာပါ</li>
<li>ဒါပြီးရင် ရေးခဲ့တဲ့ programs ကို github မှာတင်ပေးပါ။</li>
</ol>
<div class="danger">
<p>
DeadLine - <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-10-18 တေး&gt;</span></span>
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-org466ad44" class="outline-2">
<h2 id="org466ad44"><span class="section-number-2">5</span> FAQ</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org1ef3854" class="outline-3">
<h3 id="org1ef3854"><span class="section-number-3">5.1</span> Please tell me who you are ** error တက်ခဲ့လျှင်</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>မိမိစက်ထဲရှိ git repositories တွင် username and email သတ်မှတ်ရန်</li>
<li>"git config &#x2013;global user.name "name" "</li>
<li>"git config &#x2013;global user.email "*****@gmail.com" "</li>
</ul>
</div>
</div>
<div id="outline-container-orgba6ff16" class="outline-3">
<h3 id="orgba6ff16"><span class="section-number-3">5.2</span> Project တည်ဆ​ောက်ထားခြင်း မရှိသ​ေးပါက</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Github မှာ Project  ကိုအသစ်ဆ​ောက်ပါ။</li>
<li>မိမိစက်တွင် clone လုပ်ရန် "git clone URL"  ကို command တွင် ရိုက်ထည့်ပါ။</li>
</ul>
</div>
</div>
<div id="outline-container-org254e04a" class="outline-3">
<h3 id="org254e04a"><span class="section-number-3">5.3</span> Project တည်ဆ​ောက်ထားပြီးသားရှိပါက</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>" git remote add origin URL "  command တွင် ရိုက်ထည့်ပါ။  (or) ရှိပြီးသား project တွင် git ထည့်လိုပါက "git init" ပြုလုပ်ပါ။</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yelinaung</p>
<p class="date">Created: 2018-10-10 ဟူး 19:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
